main.floors.JX10=
{
    "floorId": "JX10",
    "title": "镜塔 10 层",
    "name": "镜塔 10 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10256",
    "firstArrive": [
        {
            "type": "if",
            "condition": "(flag:hard===1)",
            "true": [
                {
                    "type": "setBlock",
                    "number": "I452",
                    "loc": [
                        [
                            3,
                            1
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "I452",
                    "loc": [
                        [
                            2,
                            1
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "I452",
                    "loc": [
                        [
                            2,
                            2
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "I452",
                    "loc": [
                        [
                            2,
                            3
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "I452",
                    "loc": [
                        [
                            11,
                            1
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "I452",
                    "loc": [
                        [
                            12,
                            1
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "I452",
                    "loc": [
                        [
                            12,
                            2
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "I452",
                    "loc": [
                        [
                            12,
                            3
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "I353",
                    "loc": [
                        [
                            1,
                            5
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "I353",
                    "loc": [
                        [
                            13,
                            5
                        ]
                    ]
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,4": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "loadBgm",
                    "name": "The_Dead_Bog.mp3"
                },
                {
                    "type": "loadBgm",
                    "name": "Vampire_Killer.mp3"
                },
                "\t[血魔王,E440]我等了这么久，终于等到这一刻了！",
                "\t[菲利安,hero]你在等什么？",
                "\t[血魔王,E440]上一回在古堡，我没有修练完就被你打扰了，\n导致我没有发挥全部的实力，\n这一次，我可是做了充足的准备！",
                "\t[菲利安,hero]那个……你是谁啊？",
                "\t[血魔王,E440]什么？！",
                "\t[血魔王,E440]天哪，你真的不记得我是谁？\n上次被你羞辱过的血族魔王，凯斯！",
                "\t[菲利安,hero]哦，是你啊，变成这样我还真的认不出来。\n为了这一刻，你还费了不少心思改变你的造型。",
                "\t[血魔王,E440]那是自然的。",
                "\t[菲利安,hero]只是可惜了，你再怎么改变造型，\n也没办法遮掩你内心的污秽，\n你们所做的一切，本来就是天理不容的！",
                {
                    "type": "animate",
                    "name": "daggerskill2"
                },
                {
                    "type": "animate",
                    "name": "Thunderyellow"
                },
                {
                    "type": "animate",
                    "name": "wind2",
                    "loc": "hero"
                },
                {
                    "type": "animate",
                    "name": "star"
                },
                {
                    "type": "animate",
                    "name": "weekness"
                },
                {
                    "type": "animate",
                    "name": "darkness2"
                },
                {
                    "type": "battle",
                    "id": "E440"
                },
                "\t[菲利安,hero]咳……咳……\n还是……挺难缠……的……",
                "\t[血魔王,E440]咳………………\n可……恶……………………",
                {
                    "type": "hide",
                    "remove": true,
                    "time": 300
                },
                "\t[菲利安,hero]呼……费了不老少……力气……\n不过，他的力量大幅度增强这也就表示，\n黑暗之源，已经离我越来越近了……"
            ]
        }
    },
    "changeFloor": {
        "1,13": {
            "floorId": ":next"
        },
        "7,1": {
            "floorId": ":before"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [144,144,144,144,144,144,144,144,144,144,144,144,144,144,144],
    [144,453,451,451,20302,353,144,20433,144,353,20302,451,451,453,144],
    [144,453,451, 30, 30,353,144, 56,144,353, 30, 30,451,453,144],
    [144,453,451, 30, 27, 27, 86,478, 86, 28, 28, 30,451,453,144],
    [144,144,144,144, 27, 27,144,440,144, 28, 28,144,144,144,144],
    [10293,  0, 30,144,353,353,144,482,144,353,353,144,495,  0,10291],
    [10301, 30,  0,144,144,144,144,481,144,144,144,144,  0,495,10299],
    [10301,10285,432,10259,  0, 21,  0,333,  0, 21,  0,10262,437,20299,10299],
    [10301, 33,  0,478,  0,20007,20007,20007,20007,20007,  0,236,478, 30,10299],
    [10301,20007,20007,437,20007,20007,451, 33,  0,20007,20007,20007, 81,20007,10299],
    [10301, 34, 28,  0,353,20007,20007,20007,279,20007,353, 30,333, 30,10299],
    [10301,20007,20007,20007,  0,  0, 21, 34,  0,20007,20007,353,10260,  0,10299],
    [10301,10266,  0,20007,279,20007,20007,20007,  0,466,20007,20007,20007,472,10299],
    [10301,20425,  0,20007,  0,453,10261, 30, 30,20007,20007, 49,20007,353,10299],
    [10290,10292,10292,10292,10292,10292,10292,10292,10292,10292,10292,10292,10292,10292,10289]
],
    "underGround": true,
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,142,142,142,  0,142,  0,142,  0,142,  0,142,142,142,  0],
    [  0,142,142,142,142,142,  0,142,  0,142,142,142,142,142,  0],
    [  0,142,142,142,142,142,142,142,142,142,142,142,142,142,  0],
    [  0,  0,  0,  0,142,142,  0,142,  0,142,142,  0,  0,  0,  0],
    [  0,142,142,  0,142,142,  0,142,  0,142,142,  0,142,142,  0],
    [  0,142,  0,  0,  0,  0,  0,142,  0,  0,  0,  0,  0,142,  0],
    [  0,  0,  0,  0,  0,  0,10267,10267,10267,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,10267,10268,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,10268,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,142,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,142,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bgm": "Pure_White.mp3",
    "weather": [
        "snow",
        6
    ],
    "upFloor": [
        1,
        13
    ],
    "downFloor": [
        7,
        1
    ]
}