main.floors.JX11=
{
    "floorId": "JX11",
    "title": "镜塔 11 层",
    "name": "镜塔 11 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10256",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,13": [
            "\t[菲利安,hero]赛格博士，有什么新发现吗？",
            "\t[赛格博士,N410]唔……首先是这里有变成植物模样的门……",
            "\t[菲利安,hero]这个已经知道了，还有吗？",
            "\t[赛格博士,N410]还有就是这个区域存在神秘地域的……",
            "\t[菲利安,hero]这个我也知道了，请问还有没有其它的？",
            "\t[赛格博士,N410]你先别急嘛，让我想想……\n不知道你有没有留意到这里的大型魔物？",
            "\t[菲利安,hero]有啊，从刚进来开始到这里，已经发现三只了，\n它们有什么不对吗？",
            "\t[赛格博士,N410]根据我的调查，这个区域的最底部\n应该就是黑暗之源的所在，\n但那里无法直接到达，\n唯一能去那里的传送阵被这些大型魔物吸收了能量。",
            "\t[菲利安,hero]所以要想去那里就必须要打败所有的大型魔物？",
            "\t[赛格博士,N410]我想是的，根据我自己的调查这里能量的分布，\n照理说，应该还有一只大型魔物存在。",
            "\t[菲利安,hero]那应该在更后面的地方了……\n现在我的能力对付它们还比较勉强，\n不过我会想办法的。",
            "\t[赛格博士,N410]对付它们的时候务必要小心。\n这个地方的邪恶气息很重，\n随时都会吞噬你的心智，\n没有圣物的保护我不太敢在这里久留。",
            "\t[赛格博士,N410]所以，我得趁着自己还有力气尽快离开这里了，\n好在这个区域的基本信息已经帮你打探完了。",
            "\t[菲利安,hero]好的，不用说了……\n前方的路肯定还得我自己走对吧。\n这一路上感谢你的帮助。",
            "\t[赛格博士,N410]那么，保重了！",
            {
                "type": "animate",
                "name": "light",
                "async": true
            },
            {
                "type": "sleep",
                "time": 500,
                "noSkip": true
            },
            {
                "type": "hide",
                "remove": true
            },
            {
                "type": "waitAsync",
                "excludeAnimates": true
            }
        ]
    },
    "changeFloor": {
        "13,13": {
            "floorId": ":next"
        },
        "1,13": {
            "floorId": ":before"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "7,6": [
            {
                "type": "setValue",
                "name": "flag:镜像1层机关",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "setBlock",
                "number": "superPotion",
                "loc": [
                    [
                        7,
                        5
                    ]
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10298,10308,10308,10308,10308,10309,144,144,144,10307,10308,10308,10308,10308,10297],
    [10301, 24,20007,  0, 59,  0,144,362,144, 27,  0, 21,  0,451,10299],
    [10301,478,20007, 30,  0, 29,144, 30,144,  0,425,10260, 33,228,10299],
    [10301,333,20007,20007,432,144,144, 86,144,144,479,20007,20007,  0,10299],
    [10301,  0, 29, 34,  0,144,  0,  0,  0,144,  0,466,20007, 49,10299],
    [10301,20007,20007,444,20312,144,  0,  0,  0,144,  0,20007,20007,20007,10299],
    [10301,353,20007,  0,  0,144,  0,494,  0,144,  0,236,  0,353,10299],
    [10301, 28, 30,10262,426,144,144,482,144,144,478,20007,20007,20007,10299],
    [10301,20007, 81,20007,  0,  0,144,481,144,451,  0,20007,452,  0,10299],
    [10301,  0,228,20007,429,20302,144,441,144,10285,279,20007,20007,426,10299],
    [10301, 34,  0,20007,  0, 49,  0, 30,  0, 34,  0,437,  0, 34,10299],
    [10301,  0, 27,444,  0,20007,466,20007,425,20007,  0,10258, 27, 30,10299],
    [10301,20007,20007,20007, 81,20007,20007,20007,  0,20007, 81,20007,20007,20007,10299],
    [10301,20433,  0,  0,333,20007,453,  0,478,20007,410,  0,  0,20424,10299],
    [10290,10292,10292,10292,10292,10292,10292,10292,10292,10292,10292,10292,10292,10292,10289]
],
    "underGround": true,
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,142,142,142,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,142,142,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,142,142,142,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,142,  0,142,  0,10268,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,142,142,142,  0,10268,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,10267,10267,10267,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,10267,10267,  0,  0,  0,  0,  0,  0,  0,10267,10267,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bgm": "Pure_White.mp3",
    "weather": [
        "snow",
        6
    ],
    "upFloor": [
        13,
        13
    ],
    "downFloor": [
        1,
        13
    ]
}