main.floors.JX2=
{
    "floorId": "JX2",
    "title": "镜塔 2 层",
    "name": "镜塔 2 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "autotile4",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,11": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[混沌神,E428]这炼狱般的地方竟然还会有人来？\n胆子还真不小。\n不过，你也只能到此为止了。",
                "\t[菲利安,hero]是啊，是该到此为止了，\n本小姐也厌倦了各种打打杀杀，\n真的很想在温暖的被窝里睡上一觉。",
                "\t[混沌神,E428]既然如此，我可以帮助你沉睡，\n沉睡在各种亡魂与黑暗力量聚集的……\n这个炼狱………………",
                "\t[菲利安,hero]哼，谢谢。\n不过，该沉睡在这个炼狱中的家伙，应该是你！",
                "\t[混沌神,E428]哈哈哈哈哈哈哈……\n好久都没有这么不知死活的人类站在我的面前了，\n你勾起了我的兴趣，小姐。\n放心吧，我会对你温柔点的。",
                "\t[菲利安,hero]我不需要！",
                {
                    "type": "animate",
                    "name": "daggerskill2"
                },
                {
                    "type": "animate",
                    "name": "Thunderyellow"
                },
                {
                    "type": "animate",
                    "name": "wind2",
                    "loc": "hero"
                },
                {
                    "type": "animate",
                    "name": "star"
                },
                {
                    "type": "animate",
                    "name": "weekness"
                },
                {
                    "type": "animate",
                    "name": "darkness2"
                },
                {
                    "type": "battle",
                    "id": "E428"
                },
                {
                    "type": "setBlock",
                    "number": "null",
                    "loc": [
                        [
                            7,
                            8
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "null",
                    "loc": [
                        [
                            6,
                            9
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "null",
                    "loc": [
                        [
                            7,
                            10
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "null",
                    "loc": [
                        [
                            8,
                            9
                        ]
                    ]
                },
                "\t[混沌神,E428]这……这……这不可能！",
                {
                    "type": "hide",
                    "remove": true,
                    "time": 300
                },
                "\t[菲利安,hero]你看，我做到了，你就永远沉睡在这炼狱中吧。\n最好别再苏醒为祸人间了！"
            ]
        },
        "7,9": [
            {
                "type": "if",
                "condition": "(flag:镜像1层机关>=4)",
                "true": [
                    "黑暗地带所有的封印已经被解开，\n传送阵的能量，正在一点一点的恢复……",
                    "即将传送至未知地点……",
                    {
                        "type": "animate",
                        "name": "yongchang",
                        "loc": "hero"
                    },
                    {
                        "type": "changeFloor",
                        "floorId": "JX1",
                        "loc": [
                            7,
                            13
                        ]
                    }
                ],
                "false": [
                    "传送阵的能量似乎还不够，无法被启动。"
                ]
            }
        ]
    },
    "changeFloor": {
        "13,1": {
            "floorId": ":next"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [369,369,369,369,369,369,369,369,369,369,369,369,369,369,369],
    [369,451,  0,436,  0, 21, 21,  0, 28, 27,  0,  0,  0,20426,369],
    [369,  5,  5,  5,  5,  5,  5, 82,  5,  5,  5,  5,  5,  5,369],
    [369,457,  0,445,  0,457,  5,436,  0, 34,466,  0,469,453,369],
    [369,495,  5,  0,  5,495,  5, 34,  5,  5,  5,  5,  0,  5,369],
    [369, 24,  5, 81,  5,  5,  5,  0,  5, 49,  0,  5, 29,  0,369],
    [369,  5,  5,431,  0, 33,  0,466,  5,  0,452,  5,  0,429,369],
    [369,495,  5,  0,  5,  5,  5,  5,  5,  5,436,  5,  5, 81,369],
    [369,  0,  5,452,  0,  5,419,419,419,  5,  0, 33,  0,390,369],
    [369, 81,  5,  5,466,  5,419,367,419,  5,  5,  5,  5, 81,369],
    [369,  0,431,  0,  0,  5,419,419,419,  5,458,  0,390,  0,369],
    [369,  5,  5,  5, 81,  5,  5,428,  5,  5,  0,  5,  5, 81,369],
    [369,430,  0,  0, 27,  0,  5, 84,  5,  0,452,  5, 29,431,369],
    [369,453,  5,452,  5,468,  0,  0,  0,468,  0,  5,457,453,369],
    [369,369,369,369,369,369,369,369,369,369,369,369,369,369,369]
],
    "underGround": true,
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [11116,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,11116],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [11116,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,11116],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [11116,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,11116],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [11116,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,11116],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [11116,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,11116],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [11116,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,11116],
    [  0,  0,  0,  0,  0,  0,418,  0,418,  0,  0,  0,  0,  0,  0],
    [11116,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,11116],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgm": "Vampire_Killer.mp3",
    "flyPoint": [
        13,
        1
    ]
}