main.floors.JX24=
{
    "floorId": "JX24",
    "title": "镜塔 24 层",
    "name": "镜塔 24 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10368",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "13,13": [
            {
                "type": "if",
                "condition": "(switch:A===true)",
                "true": [
                    {
                        "type": "openShop",
                        "id": "witch",
                        "open": true
                    }
                ],
                "false": [
                    "\t[小魔女,N414]一份骷髅人的下颌骨，一份八爪鱼须，嗯……\n诶？这种地方竟然还有人能过来？",
                    "\t[菲利安,hero]嗯……很惊讶吗？\n我觉得这种地方还能有人悠闲地做饭才让人意外。",
                    "\t[小魔女,N414]小姐，我这是在调制魔药！\n在这种地方生活，总要有点特殊技能吧。\n哦对了，忘了自我介绍，我是贝丽莎，\n一个为了调制理想中的魔药而选择住这里的魔女。\n不过，还在实习中就是了。",
                    "\t[菲利安,hero]（瞄一眼）\n嗯……这能喝吗？有什么样的效果？",
                    "\t[小魔女,N414]这当然能喝了，虽然我学习调制魔药的时间很短，\n但是呢，我能保证，它们的效果非常好！\n作用嘛，手边红色的这份可以解除你的衰弱状态，\n右边绿色的这份可以解除你的中毒状态。\n现在在做的特级元气水可以大幅恢复你的体力哦！",
                    "\t[菲利安,hero]挺实用的嘛，这样对我接下来的战斗还蛮有帮助的。",
                    "\t[小魔女,N414]不过，我做的这些魔药，并不是免费的哦。\n喏，价格牌。",
                    "\t[菲利安,hero]我就知道……",
                    "\t[菲利安,hero]（左右环视）\n（这块板子好多灰尘啊，难怪她这么热情，\n原来终于有活人给她赚钱了……）",
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "true"
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "5,1": {
            "floorId": "MT25",
            "loc": [
                5,
                1
            ]
        },
        "1,13": {
            "floorId": "JX23",
            "loc": [
                1,
                13
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030],
    [20030, 27,235, 27,20006,20427,  0,  0,231, 34,20006,235, 28,451,20030],
    [20030,20006, 81,20006,20006,20006,20006, 82,20006,20006,20006, 81,20006,20006,20030],
    [20030, 34,  0, 21,  0,374,  0,439,  0,374,  0, 21,  0, 34,20030],
    [20030,20006,272,20006,20006,20006,20006, 82,20006,20006,20006,20006, 59,20006,20030],
    [20030, 33,  0,447,  0, 28,20006,246,20006, 27,  0, 29,  0, 58,20030],
    [20030,  0,452,10275, 27,  0, 81,  0,272,  0, 27,20006,218,20006,20030],
    [20030, 22,20006,20006,20006, 34,20006,218,20006,  0,20006,20006,  0, 33,20030],
    [20030,  0,220,  0,  0,  0,20006,  0,20006,374,  0, 21,  0,10276,20030],
    [20030, 29,20006,20006,20006,447,  0,  0, 81, 21,20006,20006,20006,20006,20030],
    [20030,  0, 34,20006, 27,  0,20006,  0,20006,  0, 28,20006,10274,452,20030],
    [20030, 33,  0,218,  0, 28,20006,  0,20006, 28,  0,447,  0, 28,20030],
    [20030,20006,20006,20006,20006,20006,20006,374,20006,20006,20006,20006,20006,20006,20030],
    [20030,20435,  0, 33,  0, 81,  0, 33,  0, 81,448,  0,452,414,20030],
    [20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030]
],
    "bgmap": [

],
    "fgmap": [

],
    "underGround": true,
    "bgm": "Final_Confrontation.mp3",
    "upFloor": [
        5,
        1
    ],
    "downFloor": [
        1,
        13
    ]
}