main.floors.JX9=
{
    "floorId": "JX9",
    "title": "镜塔 9 层",
    "name": "镜塔 9 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10025",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,13": [
            "\t[妖仙,fairy]小姐，我找你找得有点辛苦啊……",
            "\t[菲利安,hero]诶，你是之前雪原遇到的那个……",
            "\t[妖仙,fairy]没错，就是我，\n怎么，才这么一会你就不认识我了？",
            "\t[菲利安,hero]那倒不是啦，这里这么黑，一时半会没反应过来。",
            "\t[妖仙,fairy]能来到这里，想必那个神秘的地方你已经去过了，\n之前拜托你找的东西，你有没有帮我找到啊？",
            {
                "type": "if",
                "condition": "(item:I355>=1)",
                "true": [
                    "\t[菲利安,hero]我找到了，在一位老先生身上，\n他还说要感谢你呢，让他免于被魔化变成怪物。",
                    "\t[妖仙,fairy]………………\n哼！不要脸的家伙，随便乱捡人家东西，\n害我找了这么多年都没找到！",
                    "\t[菲利安,hero]……………………\n呃……呵呵呵……",
                    {
                        "type": "setValue",
                        "name": "item:I355",
                        "operator": "-=",
                        "value": "1"
                    },
                    "\t[妖仙,fairy]好了，之前答应过你要给你谢礼，\n我给你提升提升能力吧！\n你需要提升什么力量呢？",
                    {
                        "type": "choices",
                        "text": "\t[妖仙,fairy]你需要提升什么力量？",
                        "choices": [
                            {
                                "text": "攻击力50点",
                                "action": [
                                    {
                                        "type": "setValue",
                                        "name": "status:atk",
                                        "operator": "+=",
                                        "value": "50"
                                    },
                                    "\t[菲利安,hero]这份力量，感觉无法抗拒……\n仿佛受到了圣光的洗礼……"
                                ]
                            },
                            {
                                "text": "防御力50点",
                                "action": [
                                    {
                                        "type": "setValue",
                                        "name": "status:def",
                                        "operator": "+=",
                                        "value": "50"
                                    },
                                    "\t[菲利安,hero]这份力量，感觉无法抗拒……\n仿佛受到了圣光的洗礼……"
                                ]
                            },
                            {
                                "text": "攻防各增加25点",
                                "action": [
                                    {
                                        "type": "setValue",
                                        "name": "status:atk",
                                        "operator": "+=",
                                        "value": "25"
                                    },
                                    {
                                        "type": "setValue",
                                        "name": "status:def",
                                        "operator": "+=",
                                        "value": "25"
                                    },
                                    "\t[菲利安,hero]这份力量，感觉无法抗拒……\n仿佛受到了圣光的洗礼……"
                                ]
                            }
                        ]
                    },
                    "\t[妖仙,fairy]那么，再见咯！\n希望你接下来的任务顺利！",
                    "\t[菲利安,hero]谢谢你。"
                ],
                "false": [
                    "\t[菲利安,hero]没有欸，找了半天都没有找到，\n我在那里面都快迷路了……",
                    "\t[妖仙,fairy]那……也没办法了，毕竟丢太久了。",
                    "\t[菲利安,hero]那个，冒昧问一句，你这丢了多久了啊……",
                    "\t[妖仙,fairy]唔……不是太久吧，也就三十几年。",
                    "\t[菲利安,hero]………………………………\n（这还叫不太久啊………………）",
                    "\t[妖仙,fairy]总之依然谢谢你帮我在里面找过，\n据我所知，接下来的路会更加错综复杂，\n你可千万要小心别在里面迷路了哦！",
                    "\t[菲利安,hero]知道了，我会小心的。"
                ]
            },
            {
                "type": "animate",
                "name": "light",
                "async": true
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "hide",
                "remove": true
            },
            {
                "type": "tip",
                "text": "有些门是用植物伪装的，请留意"
            },
            {
                "type": "waitAsync"
            }
        ]
    },
    "changeFloor": {
        "7,1": {
            "floorId": ":next"
        },
        "1,13": {
            "floorId": ":before"
        },
        "13,8": {
            "floorId": ":before"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [366,366,366,366,366,366,366,366,366,366,366,366,366,366,366],
    [366,452,  0, 29,228,  0,366,20425,366, 27,366,453,  0,453,366],
    [366,366,366,  0,366, 34,366,  0,366,  0,366,366,472,366,366],
    [366,  0,445,  0,366,  0,432,  0, 21,436,  0, 29,  0,  0,366],
    [366, 34,366, 28,366,366,366,366,366,  0,366,366,366,436,366],
    [366, 21,366, 28,366,458,366,  0,433,  0,433,366, 29,  0,366],
    [366,  0,366,  0,436,  0,366,452,366,366,  0,366,  0,452,366],
    [366,432,366,366,366,366,366,457,366,466,457,366, 81,366,366],
    [366,  0,445, 81,  0,451,366,457,366,366,  0,  0,  0,20432,366],
    [366, 29,  0,366, 33,  0,437,  0,366,466,458,366,366,366,366],
    [366,228,366,366,366,436,366,366,366,366,  0, 81,  0,457,366],
    [366,  0, 27,  0,433,  0,433,  0,  0,366,366,366,366,436,366],
    [366,366,366, 81,366,  0,366,366,437,  0,452,366, 29,  0,366],
    [366,20433,  0,124,366,457,495,366, 21,366,453,366,  0, 21,366],
    [366,366,366,366,366,366,366,366,366,366,366,366,366,366,366]
],
    "underGround": true,
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "The_Dead_Bog.mp3",
    "upFloor": [
        7,
        1
    ],
    "downFloor": [
        1,
        13
    ]
}