main.floors.MT15=
{
    "floorId": "MT15",
    "title": "主塔 15 层",
    "name": "主塔 15 层",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10025",
    "firstArrive": [
        {
            "type": "if",
            "condition": "(flag:hard<=2)",
            "true": [
                {
                    "type": "setBlock",
                    "number": "I451",
                    "loc": [
                        [
                            11,
                            5
                        ]
                    ]
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,0": {
            "trigger": null,
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 0,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "14,7": {
            "trigger": null,
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 0,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "10,3": [
            "\t[菲利安,hero]赛格博士，又见面了。\n方便问一下有什么新的发现吗？",
            "\t[赛格博士,N410]不知道刚才你上来的时候有没有注意到14层的那根草？",
            "\t[菲利安,hero]经你这么一说我才想起来的确有，\n那根草挺不起眼的，我都没怎么留意。\n它有什么奇怪的地方吗？",
            "\t[赛格博士,N410]起初我也没有留意到那棵草，直到我发现，\n这里的魔物似乎很害怕那里，\n我隐约觉得它不简单，就去调查了一下。\n发现那根草其实是封印神秘诅咒的圣器。",
            "\t[赛格博士,N410]只不过，它被奇怪的机关封印着，\n根据周遭的魔法痕迹来看，\n封印它的魔法应该是不久前才施放的。",
            "\t[菲利安,hero]想也知道是谁干的……\n那么，我该怎么破解这个封印并拿到它呢？",
            "\t[赛格博士,N410]解除封印的机关在第10层，一共有四个。\n把机关破解掉应该就能显现出圣器原本的样子了。",
            "\t[菲利安,hero]我知道了，请问还有其他的信息吗？",
            "\t[赛格博士,N410]另一个调查的点在于这里被看守的两把法杖，\n它们似乎是某样东西的增幅器。\n我估计跟第2层被看守的两样圣器有关。\n不过，第2层有机关的痕迹，\n应该是人走上去后就会触发。",
            "\t[菲利安,hero]那么，那是什么样的机关？",
            "\t[赛格博士,N410]应该只是单纯的关门机关，不过一旦走过去，\n被关闭的那扇机关门就再也打不开了，\n所以那两个圣器应该是只能二选一的。\n选择什么取决于你想要什么样的力量。",
            "\t[菲利安,hero]我明白了，感谢你告诉我的信息。",
            "\t[赛格博士,N410]不必这么客气，我愿意帮助你，\n不完全是因为你父亲的委托，\n我乐意调查这里也是因为\n我自己对这类神秘建筑也是挺有兴趣的。\n那么，我继续去调查了，你务必要小心。",
            "\t[菲利安,hero]好的。",
            {
                "type": "tip",
                "text": "第10层的机关跟第14层封印的宝物有关"
            },
            {
                "type": "animate",
                "name": "light",
                "async": true
            },
            {
                "type": "sleep",
                "time": 500,
                "noSkip": true
            },
            {
                "type": "hide",
                "remove": true
            },
            {
                "type": "waitAsync",
                "excludeAnimates": true
            }
        ]
    },
    "changeFloor": {
        "7,0": {
            "floorId": ":before"
        },
        "14,7": {
            "floorId": ":next"
        },
        "0,7": {
            "floorId": "MT14",
            "loc": [
                0,
                7
            ]
        },
        "7,14": {
            "floorId": "MT14",
            "loc": [
                7,
                14
            ]
        },
        "14,13": {
            "floorId": "MT16",
            "loc": [
                14,
                13
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  4,  4,  4,  4,  4,  4,  4, 88,  4,  4,  4,  4,  4,  4,  4],
    [  4, 27,  0,211, 34,  4,  4,  0,  4,  4,  0,207,  0, 33,  4],
    [  4,  4,  4,  4,  0,  4,  4,204,  4,  4,  0,  4,  4,  4,  4],
    [  4,451,  4, 32,335,  0,271,  0, 21,450,410,  0,  4, 59,  4],
    [  4, 33,  0,  4,  4,  4,  4,  4,  4,  4, 22,  0,237,  0,  4],
    [  4,  4,234,  0,271,  0,  4,357,211,  4,  0, 34,  4,  4,  4],
    [  4, 31,  4,450,  4,451,  4,  4,  0, 84,253,  4,  4, 27,  4],
    [  0,  0,218,  0,  4,452,  4,358,211,  4,  0, 81,450,  0, 87],
    [  4, 31,  4, 27,  4,  4,  4,  4,  4,218, 31,  4,  4, 28,  4],
    [  4,  4,  4,  4,  4, 28,  0,335,  0,  4, 32,  4,218,  4,  4],
    [  4, 32, 31,  0,462,  0, 32,11110, 21,  0,237,  0,  0, 32,  4],
    [  4,  4,  4, 81,  4,  4,  4,  4,  4,  4,  4,  4, 30,  0,  4],
    [  4,451,  4,211,  0,  4, 27,  0, 28,219,  0,  4,  4,  4,  4],
    [  4,  0,207,  0, 21,  4,  0, 31,  0,  4, 23,  0,453,  0,  0],
    [  4,  4,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  4,  4]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,10255,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10247,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,10374,  0,10374,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,10382,  0,10382,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,465,  0,465,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10374,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10374],
    [10382,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,465,  0,10382],
    [10374,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10374],
    [10382,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,465,  0,10382],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10374],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10382],
    [  0,  0,  0,  0,  0,  0,10374,  0,10374,  0,  0,  0,  0,  0,10374],
    [  0,  0,  0,  0,  0,  0,10382,  0,10382,  0,  0,  0,  0,  0,10382]
],
    "bgm": "Besieged_Village.mp3",
    "upFloor": [
        14,
        7
    ],
    "downFloor": [
        7,
        0
    ]
}