main.floors.SM10=
{
    "floorId": "SM10",
    "title": "神秘 10 域",
    "name": "神秘 10 域",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,4": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[黑暗魔王,blackKing]终于来了吗？",
                "\t[菲利安,hero]你好像等了我很久的样子，\n看你的眼神，好像还很期待我能过来。",
                "\t[黑暗魔王,blackKing]因为我知道你很有本事，我向来很尊敬有能力的人。\n这样，你才有资格被这个大魔法阵进一步吸收能量啊！",
                "\t[菲利安,hero]……\n（还以为会有不一样一点的开场白呢）",
                "\t[黑暗魔王,blackKing]想想Cardinal大人会怎么奖赏我吧，\n我解决了给他添了这么多麻烦的人，\n我一定可以……",
                "\t[菲利安,hero]你可以个什么劲啊！",
                {
                    "type": "animate",
                    "name": "daggerskill2"
                },
                {
                    "type": "animate",
                    "name": "Thunderyellow"
                },
                {
                    "type": "animate",
                    "name": "wind2",
                    "loc": "hero"
                },
                {
                    "type": "animate",
                    "name": "heal2"
                },
                {
                    "type": "animate",
                    "name": "darkness2"
                },
                {
                    "type": "battle",
                    "id": "blackKing"
                },
                {
                    "type": "hide",
                    "remove": true,
                    "time": 600
                },
                "\t[菲利安,hero]糟糕，下手又太重了，\n他那么有自信，还以为多厉害呢。"
            ]
        },
        "7,1": [
            {
                "type": "if",
                "condition": "(switch:A===true)",
                "true": [],
                "false": [
                    "你触动了这个石碑上的机关，\n神秘的力量正在逐渐散发出来……",
                    {
                        "type": "animate",
                        "name": "starwithmoon",
                        "loc": [
                            7,
                            7
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20813",
                        "loc": [
                            [
                                6,
                                0
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20814",
                        "loc": [
                            [
                                7,
                                0
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20815",
                        "loc": [
                            [
                                8,
                                0
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20821",
                        "loc": [
                            [
                                6,
                                1
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20822",
                        "loc": [
                            [
                                7,
                                1
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20823",
                        "loc": [
                            [
                                8,
                                1
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20891",
                        "loc": [
                            [
                                6,
                                6
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20892",
                        "loc": [
                            [
                                7,
                                6
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20893",
                        "loc": [
                            [
                                8,
                                6
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20899",
                        "loc": [
                            [
                                6,
                                7
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20900",
                        "loc": [
                            [
                                7,
                                7
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20901",
                        "loc": [
                            [
                                8,
                                7
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20907",
                        "loc": [
                            [
                                6,
                                8
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20908",
                        "loc": [
                            [
                                7,
                                8
                            ]
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "X20909",
                        "loc": [
                            [
                                8,
                                8
                            ]
                        ]
                    },
                    {
                        "type": "openDoor",
                        "loc": [
                            5,
                            7
                        ],
                        "async": true
                    },
                    {
                        "type": "openDoor",
                        "loc": [
                            9,
                            7
                        ],
                        "async": true
                    },
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "true"
                    },
                    {
                        "type": "waitAsync",
                        "excludeAnimates": true
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "7,13": {
            "floorId": ":before"
        },
        "1,7": {
            "floorId": ":before"
        },
        "13,7": {
            "floorId": ":before"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20030,20030,20030,20030,20030,20030,20810,20811,20812,20030,20030,20030,20030,20030,20030],
    [20030,  0,  0,  0,  0,20030,20818,20819,20820,20030,  0,  0,  0,  0,20030],
    [20030,  0,20246,  0,20246,20030,20030, 84,20030,20030,20246,  0,20246,  0,20030],
    [20030,  0,  0,20671,  0,  0,20030,  0,20030,  0,  0,20671,  0,  0,20030],
    [20030,  0,  0,20679,  0,  0,20030,229,20030,  0,  0,20679,  0,  0,20030],
    [20030,  0,  0,  0,  0,20030,20030,  0,20030,20030,  0,  0,  0,  0,20030],
    [20030,20030,20030,20030,20030,20030,20888,20889,20890,20030,20030,20030,20030,20030,20030],
    [20030,20433,  0, 33,  0, 85,20896,20897,20898, 85,  0, 33,  0,20432,20030],
    [20030,20030,20030,20030,20030,20030,20904,20905,20906,20030,20030,20030,20030,20030,20030],
    [20030,  0,  0,  0,  0,20030,20030,  0,20030,20030,  0,  0,  0,  0,20030],
    [20030,  0,  0,20671,  0,  0,20030,333,20030,  0,  0,20671,  0,  0,20030],
    [20030,  0,  0,20679,  0,  0,20030,  0,20030,  0,  0,20679,  0,  0,20030],
    [20030,  0,20246,  0,20246,  0,20030,  0,20030,  0,20246,  0,20246,  0,20030],
    [20030,  0,  0,  0,  0,  0,20030,20433,20030,  0,  0,  0,  0,  0,20030],
    [20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030,20030]
],
    "bgm": "The_Swamp_Troll.mp3",
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,10369,10369,10369,10369,  0,  0,  0,  0,  0,10369,10369,10369,10369,  0],
    [  0,10369,10369,10369,10369,  0,  0,  0,  0,  0,10369,10369,10369,10369,  0],
    [  0,10369,10369,10369,10369,10369,  0,  0,  0,10369,10369,10369,10369,10369,  0],
    [  0,10369,10369,10369,10369,10369,  0,  0,  0,10369,10369,10369,10369,10369,  0],
    [  0,10369,10369,10369,10369,  0,  0,  0,  0,  0,10369,10369,10369,10369,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,10369,10369,10369,10369,  0,  0,  0,  0,  0,10369,10369,10369,10369,  0],
    [  0,10369,10369,10369,10369,10369,  0,  0,  0,10369,10369,10369,10369,10369,  0],
    [  0,10369,10369,10369,10369,10369,  0,  0,  0,10369,10369,10369,10369,10369,  0],
    [  0,10369,10369,10369,10369,10369,  0,  0,  0,10369,10369,10369,10369,10369,  0],
    [  0,10369,10369,10369,10369,10369,  0,  0,  0,10369,10369,10369,10369,10369,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "flyPoint": [
        7,
        13
    ]
}